## Question 1

You have been given the "mtcars" dataset in R, which contains information about various models of cars. How can you display the first 6 rows of the "mtcars" data frame with only the columns "mpg", "cyl", "wt", and "gear"?

In [1]:
data(mtcars)
new_df <- mtcars[, c("mpg", "cyl", "wt", "gear")]
head(new_df, 6)

                  mpg  cyl wt    gear
Mazda RX4         21.0 6   2.620 4
Mazda RX4 Wag     21.0 6   2.875 4
Datsun 710        22.8 4   2.320 4
Hornet 4 Drive    21.4 6   3.215 3
Hornet Sportabout 18.7 8   3.440 3
Valiant           18.1 6   3.460 3

## Question 2

Using the "mtcars" data set in R, take the mean of miles per gallon of each cylinder and transmission combination (4 cyl, automatic; 6 cyl, manual, etc.)

Hint : Use the aggregate() function.

```r
dfmean <- aggregate(mtcars$mpg, by = list(mtcars$cyl, mtcars$am), FUN = mean)
colnames(dfmean) <- c("Cylinders", "Transmission", "Average Miles Per Gallon")

dfmean
```

In [14]:
# There's a problem in github, so the solution is also given above
dfmean <- aggregate(mtcars$mpg, by = list(mtcars$cyl, mtcars$am), FUN = mean)
colnames(dfmean) <- c("Cylinders", "Transmission", "Average Miles Per Gallon")

dfmean

  Cylinders Transmission Average Miles Per Gallon
1 4         0            22.90000
2 6         0            19.12500
3 8         0            15.05000
4 4         1            28.07500
5 6         1            20.56667
6 8         1            15.40000

## Question 3

Using the “mtcars” dataset in R, extract the rows where the number of cylinders is greater than or equal to 6, and the miles per gallon is greater than 15. Assing the resulting data frame to a new variable called “mtcars_high”.

In [3]:
data(mtcars)
high_mpg_cylinders <- mtcars[mtcars$cyl >= 6 & mtcars$mpg > 15, ]
high_mpg_cylinders

                  mpg  cyl disp  hp  drat wt    qsec  vs am gear carb
Mazda RX4         21.0 6   160.0 110 3.90 2.620 16.46 0  1  4    4
Mazda RX4 Wag     21.0 6   160.0 110 3.90 2.875 17.02 0  1  4    4
Hornet 4 Drive    21.4 6   258.0 110 3.08 3.215 19.44 1  0  3    1
Hornet Sportabout 18.7 8   360.0 175 3.15 3.440 17.02 0  0  3    2
Valiant           18.1 6   225.0 105 2.76 3.460 20.22 1  0  3    1
Merc 280          19.2 6   167.6 123 3.92 3.440 18.30 1  0  4    4
Merc 280C         17.8 6   167.6 123 3.92 3.440 18.90 1  0  4    4
Merc 450SE        16.4 8   275.8 180 3.07 4.070 17.40 0  0  3    3
Merc 450SL        17.3 8   275.8 180 3.07 3.730 17.60 0  0  3    3
Merc 450SLC       15.2 8   275.8 180 3.07 3.780 18.00 0  0  3    3
Dodge Challenger  15.5 8   318.0 150 2.76 3.520 16.87 0  0  3    2
AMC Javelin       15.2 8   304.0 150 3.15 3.435 17.30 0  0  3    2
Pontiac Firebird  19.2 8   400.0 175 3.08 3.845 17.05 0  0  3    2
Ford Pantera L    15.8 8   351.0 264 4.22 3.170 14.50 0  1  5    4
Ferrari Dino      19.7 6   145.0 175 3.62 2.770 15.50 0  1  5    6

## Question 4

You are given the built-in dataset ChickWeight in R, which contains information about the growth of birds over time, including their weight, age, and diet. Download the dataset and solve the following tasks:

- Create a new column that calculates the weight gain of each bird over time.

- Find the maximum weight gain of any chick. 

*Hint*: set na.rm parameter of the max() function to TRUE (na.rm: a logical indicating whether missing values should be removed)

- Create a new data frame that summarizes the average weight gain of chicks by diet.

```r

chick_weight_df <- ChickWeight
chick_weight_df$WeightGain <- c(NA, diff(chick_weight_df$weight))
max_weight_gain <- max(chick_weight_df$WeightGain, na.rm = TRUE)
average_weight_gain_by_diet <- aggregate(WeightGain ~ Diet, data = chick_weight_df, FUN = mean)
average_weight_gain_by_diet

```

In [4]:
# There's a problem in github, so the solution is also given above
chick_weight_df <- ChickWeight
chick_weight_df$WeightGain <- c(NA, diff(chick_weight_df$weight))
max_weight_gain <- max(chick_weight_df$WeightGain, na.rm = TRUE)
average_weight_gain_by_diet <- aggregate(WeightGain ~ Diet, data = chick_weight_df, FUN = mean)
average_weight_gain_by_diet

  Diet WeightGain
1 1     0.3424658
2 2     0.2750000
3 3     1.4250000
4 4    -0.4830508

## Question 5

Suppose you have a data frame called "sales" that contains the following variables:

month: the month in which a sale was made (either "January", "February", "March", or "April")

product: the type of product sold (either "A", "B", or "C")

units_sold: the number of units sold in each transaction (the number of sales can be between 1 and 10)

price_per_unit: the price per unit in US dollars (prices must be between 5 and 15 and integer, can be done using runif() )

Write R code to perform the following tasks:

1. Create a data frame with 20 observations for the variables "month", "product", "units_sold", and "price_per_unit".

2. Display the data frame.

3. Calculate the total revenue and display the results.

4. Create a new variable called "is_product_A" that indicates whether each observation corresponds to product A (TRUE) or not (FALSE).

5. Create a new data frame called "march_sales" that contains only the observations for the month of March.

```r

set.seed(123) 
month <- sample(c("January", "February", "March", "April"), 20, replace = TRUE)
product <- sample(c("A", "B", "C"), 20, replace = TRUE)
units_sold <- sample(1:10, 20, replace = TRUE)
price_per_unit <- round((runif(20, min = 5, max = 25)))
sales <- data.frame(month, product, units_sold, price_per_unit)

sales$revenue <- sales$units_sold * sales$price_per_unit
revenue_summary <- sum(sales$revenue)
revenue_summary

sales$is_product_A <- sales$product == "A"
sales$is_product_A 

march_sales <- subset(sales, month == "March")
march_sales

```

In [5]:
# There's a problem in github, so the solution is also given above
set.seed(123) 
month <- sample(c("January", "February", "March", "April"), 20, replace = TRUE)
product <- sample(c("A", "B", "C"), 20, replace = TRUE)
units_sold <- sample(1:10, 20, replace = TRUE)
price_per_unit <- round((runif(20, min = 5, max = 25)))
sales <- data.frame(month, product, units_sold, price_per_unit)

sales$revenue <- sales$units_sold * sales$price_per_unit
revenue_summary <- sum(sales$revenue)
revenue_summary

sales$is_product_A <- sales$product == "A"
sales$is_product_A 

march_sales <- subset(sales, month == "March")
march_sales

[1] 1846

 [1]  TRUE  TRUE  TRUE  TRUE FALSE FALSE FALSE FALSE  TRUE FALSE FALSE FALSE
[13]  TRUE FALSE FALSE  TRUE FALSE FALSE  TRUE FALSE

   month product units_sold price_per_unit revenue is_product_A
1  March A        9         13             117      TRUE
2  March A        9         17             153      TRUE
3  March A       10         12             120      TRUE
5  March C        5         10              50     FALSE
9  March A        9          7              63      TRUE
16 March A        9         18             162      TRUE
19 March A        9         11              99      TRUE
20 March C       10          9              90     FALSE

## Question 6

Below are two data frames, ```df1``` and ```df2```, containing information about students. 

```df1``` contains information about the students' names, majors, and grades in Math and Science, while ```df2``` contains information about the students' names, majors, and grades in English and History. 

Merge these data frames into a single data frame called ```df_merged``` that contains all of the information, and also calculate the average grade for each student and add the average to a new column.

```df1``` is:

| Name    | Major | Math | Science |
| -----   | ---   | ---- | ------- |
| Alice   |  EC   |  80  | 90 |
| Bob     |  MGMT |  90  | 80 |
| Charlie |  POLS |  70  | 75 |

```df2``` is:

| Name    | Major | English | History |
| -----   | ---   | ----    | ------- |
| Alice   |  EC   |    85   |    90   |
| Charlie |  POLS |    75   |    80   |
| Dave    |  EC   |    80   |    85   |

Your output should look like:

```r
     Name Major Math Science English History AvgGrade
1   Alice    EC   80      90      85      90    86.25
2     Bob  MGMT   90      80      NA      NA    85.00
3 Charlie  POLS   70      75      75      80    75.00
4    Dave    EC   NA      NA      80      85    82.50
```

In [6]:
df1 <- data.frame(Name = c("Alice", "Bob", "Charlie"),
                  Major = c("EC", "MGMT", "POLS"),
                  Math = c(80, 90, 70),
                  Science = c(90, 80, 75))

df2 <- data.frame(Name = c("Alice", "Charlie", "Dave"),
                  Major = c("EC", "POLS", "EC"),
                  English = c(85, 75, 80),
                  History = c(90, 80, 85))

df_merged <- merge(df1, df2, by = c("Name", "Major"), all = TRUE)

df_merged$AvgGrade <- rowMeans(df_merged[,3:6], na.rm = TRUE)

df_merged

  Name    Major Math Science English History AvgGrade
1 Alice   EC    80   90      85      90      86.25
2 Bob     MGMT  90   80      NA      NA      85.00
3 Charlie POLS  70   75      75      80      75.00
4 Dave    EC    NA   NA      80      85      82.50

## Prep 

Run the following code

In [ ]:
install.packages("nycflights13")
library(nycflights13)
flights <- as.data.frame(flights)
head(flights)

In [8]:
# We can also view the structure of our data frame as such:

str(flights)

'data.frame':	336776 obs. of  19 variables:
 $ year          : int  2013 2013 2013 2013 2013 2013 2013 2013 2013 2013 ...
 $ month         : int  1 1 1 1 1 1 1 1 1 1 ...
 $ day           : int  1 1 1 1 1 1 1 1 1 1 ...
 $ dep_time      : int  517 533 542 544 554 554 555 557 557 558 ...
 $ sched_dep_time: int  515 529 540 545 600 558 600 600 600 600 ...
 $ dep_delay     : num  2 4 2 -1 -6 -4 -5 -3 -3 -2 ...
 $ arr_time      : int  830 850 923 1004 812 740 913 709 838 753 ...
 $ sched_arr_time: int  819 830 850 1022 837 728 854 723 846 745 ...
 $ arr_delay     : num  11 20 33 -18 -25 12 19 -14 -8 8 ...
 $ carrier       : chr  "UA" "UA" "AA" "B6" ...
 $ flight        : int  1545 1714 1141 725 461 1696 507 5708 79 301 ...
 $ tailnum       : chr  "N14228" "N24211" "N619AA" "N804JB" ...
 $ origin        : chr  "EWR" "LGA" "JFK" "JFK" ...
 $ dest          : chr  "IAH" "IAH" "MIA" "BQN" ...
 $ air_time      : num  227 227 160 183 116 150 158 53 140 138 ...
 $ distance      : num  1400 1416 1089 1576 762 ...
 $ hour          : num  5 5 5 5 6 5 6 6 6 6 ...
 $ minute        : num  15 29 40 45 0 58 0 0 0 0 ...
 $ time_hour     : POSIXct, format: "2013-01-01 05:00:00" "2013-01-01 05:00:00" ...

In [9]:
head(flights)

  year month day dep_time sched_dep_time dep_delay arr_time sched_arr_time
1 2013 1     1   517      515             2         830      819
2 2013 1     1   533      529             4         850      830
3 2013 1     1   542      540             2         923      850
4 2013 1     1   544      545            -1        1004     1022
5 2013 1     1   554      600            -6         812      837
6 2013 1     1   554      558            -4         740      728
  arr_delay carrier flight tailnum origin dest air_time distance hour minute
1  11       UA      1545   N14228  EWR    IAH  227      1400     5    15
2  20       UA      1714   N24211  LGA    IAH  227      1416     5    29
3  33       AA      1141   N619AA  JFK    MIA  160      1089     5    40
4 -18       B6       725   N804JB  JFK    BQN  183      1576     5    45
5 -25       DL       461   N668DN  LGA    ATL  116       762     6     0
6  12       UA      1696   N39463  EWR    ORD  150       719     5    58
  time_hour
1 2013-01-01 05:00:00
2 2013-01-01 05:00:00
3 2013-01-01 05:00:00
4 2013-01-01 05:00:00
5 2013-01-01 06:00:00
6 2013-01-01 05:00:00

## Question 8

Combine the year, month and day information into a new column called dates. 

Then, create a new column called weekdays which shows which day of the week each flight has taken place.

Report the first six rows of your data frame as such:

```R
> head(flights)

  year month day dep_time dep_delay arr_time arr_delay cancelled carrier tailnum flight origin dest air_time distance
1 2014     1   1      914        14     1238        13         0      AA  N338AA      1    JFK  LAX      359     2475
2 2014     1   1     1157        -3     1523        13         0      AA  N335AA      3    JFK  LAX      363     2475
3 2014     1   1     1902         2     2224         9         0      AA  N327AA     21    JFK  LAX      351     2475
4 2014     1   1      722        -8     1014       -26         0      AA  N3EHAA     29    LGA  PBI      157     1035
5 2014     1   1     1347         2     1706         1         0      AA  N319AA    117    JFK  LAX      350     2475
6 2014     1   1     1824         4     2145         0         0      AA  N3DEAA    119    EWR  LAX      339     2454
  hour min      dates weekdays
1    9  14 2014-01-01      Çar
2   11  57 2014-01-01      Çar
3   19   2 2014-01-01      Çar
4    7  22 2014-01-01      Çar
5   13  47 2014-01-01      Çar
6   18  24 2014-01-01      Çar
```

*Hint: You can use ``with()`` for the first part and ``weekdays`` for the second part.*

```r

flights$dates <- with(flights, as.Date(paste(year, month, day, sep = "-")))
flights$weekdays <- weekdays(flights$dates, abbreviate = T)
head(flights)
```

In [10]:
# There's a problem in github, so the solution is also given above
flights$dates <- with(flights, as.Date(paste(year, month, day, sep = "-")))
flights$weekdays <- weekdays(flights$dates, abbreviate = T)
head(flights)

  year month day dep_time sched_dep_time dep_delay arr_time sched_arr_time
1 2013 1     1   517      515             2         830      819
2 2013 1     1   533      529             4         850      830
3 2013 1     1   542      540             2         923      850
4 2013 1     1   544      545            -1        1004     1022
5 2013 1     1   554      600            -6         812      837
6 2013 1     1   554      558            -4         740      728
  arr_delay carrier ... tailnum origin dest air_time distance hour minute
1  11       UA      ... N14228  EWR    IAH  227      1400     5    15
2  20       UA      ... N24211  LGA    IAH  227      1416     5    29
3  33       AA      ... N619AA  JFK    MIA  160      1089     5    40
4 -18       B6      ... N804JB  JFK    BQN  183      1576     5    45
5 -25       DL      ... N668DN  LGA    ATL  116       762     6     0
6  12       UA      ... N39463  EWR    ORD  150       719     5    58
  time_hour           dates      weekdays
1 2013-01-01 05:00:00 2013-01-01 Tue
2 2013-01-01 05:00:00 2013-01-01 Tue
3 2013-01-01 05:00:00 2013-01-01 Tue
4 2013-01-01 05:00:00 2013-01-01 Tue
5 2013-01-01 06:00:00 2013-01-01 Tue
6 2013-01-01 05:00:00 2013-01-01 Tue

## Question 9

Using **flights**, create a data frame called **dep_delay_origin_dest2** that shows the count of flights and the average departure delay for each origin and destination pair as such:

```R
> head(dep_delay_origin_dest2)

  origin dest count av_dep_delay
1    JFK  ABQ   278    15.316547
2    JFK  ACK   277     4.277978
3    LGA  AGS     3    -1.333333
4    EWR  ALB   169    21.538462
5    EWR  ANC    13    12.615385
6    EWR  ATL  4182    17.602822
```

*Hint: Use the function ``aggregate()``.*

In [11]:
dep_delay_origin_dest <- with(flights, aggregate(dep_delay,
                                          by = list(origin, dest),
                                          FUN = function(x) c(length(x), mean(x))
                                                 )
                              )

dep_delay_origin_dest2 <- data.frame(dep_delay_origin_dest[,1:2], dep_delay_origin_dest[,3])

names(dep_delay_origin_dest2) <- c("origin",
                                   "dest",
                                   "count",
                                   "av_dep_delay")
head(dep_delay_origin_dest2)

  origin dest count av_dep_delay
1 JFK    ABQ   254  13.740157
2 JFK    ACK   265   6.456604
3 EWR    ALB   439         NA
4 EWR    ANC     8  12.875000
5 EWR    ATL  5022         NA
6 JFK    ATL  1930         NA

## QUESTION 10

Using **dep_delay_origin_dest2**, report 

- The most active 10 airport pairs in terms of flight counts in a data frame called **most_active**
- The most delaying 10 airport pairs in terms of average departure delays in a data frame called **most_delayed**

These two matrices should be in decreasing order in their respective criteria.

```R
> most_active

    origin dest count av_dep_delay
109    JFK  LAX 10208     8.359718
195    JFK  SFO  7368    11.741178
146    LGA  ORD  7052    12.708026
8      LGA  ATL  6925    13.813574
126    LGA  MIA  5084     6.030488
194    EWR  SFO  4539    16.530293
115    JFK  MCO  4467    13.477726
20     EWR  BOS  4268    11.265933
108    EWR  LAX  4226    15.882631
6      EWR  ATL  4182    17.602822
```

```R
> most_delayed

    origin dest count av_dep_delay
102    JFK  JAC     1    322.00000
68     LGA  DSM     1    125.00000
13     EWR  AVP     1     83.00000
121    LGA  MEM     3     54.33333
73     JFK  EGE    85     43.32941
217    LGA  TVC    36     37.94444
36     EWR  CAE    21     36.09524
218    EWR  TYS   238     32.81513
130    LGA  MSN   188     29.31915
215    EWR  TUL   201     28.89552
```

In [12]:

most_active <- dep_delay_origin_dest2[order(dep_delay_origin_dest2$count, decreasing = T),][1:10,]
most_delayed <-dep_delay_origin_dest2[order(dep_delay_origin_dest2$av_dep_delay, decreasing = T),][1:10,]
most_active
most_delayed

    origin dest count av_dep_delay
107 JFK    LAX  11262 NA
7   LGA    ATL  10263 NA
148 LGA    ORD   8857 NA
197 JFK    SFO   8204 NA
47  LGA    CLT   6168 NA
146 EWR    ORD   6100 NA
20  JFK    BOS   5898 NA
126 LGA    MIA   5781 NA
115 JFK    MCO   5464 NA
19  EWR    BOS   5327 NA

    origin dest count av_dep_delay
190 LGA    SBN    6   31.333333
36  LGA    CAE   12   29.500000
208 JFK    STL    1   20.000000
120 JFK    MEM    1   14.000000
1   JFK    ABQ  254   13.740157
4   EWR    ANC    8   12.875000
14  JFK    BHM    1    7.000000
2   JFK    ACK  265    6.456604
189 EWR    SBN    4    5.750000
100 JFK    JAC    2    5.000000

## Question 11


- Merge the **flights** and **dep_delay_origin_dest2** data frames into **flights2**, so that we have the count of flights and average departure delay for each airport pair on all rows.
- Create a new column **dev_delay** which will show the difference between the departure delay and the average departure delay for each row.

Then report the first 10 rows of **flights2** in decreasing order as such:

```R
       origin dest year month day dep_time dep_delay arr_time arr_delay cancelled carrier tailnum flight air_time
26298     EWR  DFW 2014    10   4      727      1498     1008      1494         0      AA  N4WJAA   1381      200
94999     JFK  BOS 2014     4  15     1341      1241     1443      1223         0      AA  N3FNAA    256       39
3809      EWR  ATL 2014     7  14      823      1087     1046      1090         0      DL  N966AT    673       97
24951     EWR  DFW 2014     6  13     1046      1071     1329      1064         0      AA  N502AA   2488      175
26816     EWR  DFW 2014     9  12      636      1056     1015      1115         0      AA  N548AA   1642      198
24850     EWR  DFW 2014     6  16      731      1022     1057      1073         0      AA  N491AA    320      178
128692    JFK  MCO 2014     2  21      844      1014     1151      1007         0      DL  N983DL   2459      139
105903    JFK  DEN 2014     2  15     1244      1003     1517       994         0      DL  N3747D    475      242
26848     EWR  DFW 2014     6  11     1119       989     1411       991         0      AA  N569AA   1691      194
223331    LGA  MIA 2014     1   2     1108       973     1456       996         0      DL  N980DL   2139      156
       distance hour min      dates weekdays count av_dep_delay dev_delay
26298      1372    7  27 2014-10-04      Cmt  2224    16.616906 1481.3831
94999       187   13  41 2014-04-15      Sal  4111    11.584529 1229.4155
3809        746    8  23 2014-07-14      Pzt  4182    17.602822 1069.3972
24951      1372   10  46 2014-06-13      Cum  2224    16.616906 1054.3831
26816      1372    6  36 2014-09-12      Cum  2224    16.616906 1039.3831
24850      1372    7  31 2014-06-16      Pzt  2224    16.616906 1005.3831
128692      944    8  44 2014-02-21      Cum  4467    13.477726 1000.5223
105903     1626   12  44 2014-02-15      Cmt   579    18.226252  984.7737
26848      1372   11  19 2014-06-11      Çar  2224    16.616906  972.3831
223331     1096   11   8 2014-01-02      Per  5084     6.030488  966.9695
```

In [13]:
origin_dest_wide <- reshape(dep_delay_origin_dest2,
                      idvar = c("dest"),
                      v.names = "av_dep_delay",
                      timevar = "origin",
                      direction = "wide",
                        drop = "count")
names(origin_dest_wide)[-1] <- c("JFK", "LGA", "EWR")
origin_dest_wide[order(origin_dest_wide$JFK, decreasing = T),c("dest", "JFK")][1:10,]

    dest JFK
207 STL  20.000000
119 MEM  14.000000
1   ABQ  13.740157
14  BHM   7.000000
2   ACK   6.456604
99  JAC   5.000000
84  HNL   4.900585
3   ALB         NA
4   ANC         NA
5   ATL         NA